/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstsize.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By:        <                    >              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/19 19:09:24 by                   #+#    #+#             */
/*   Updated: 2020/08/11 17:52:08 by                  ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// 노드 갯수 반환하는 함수

int		ft_lstsize(t_list *lst)
{
	size_t	size; // 갯수 셀 변수

	size = 0; // 0 저장
	while (lst) // 노드가 존재할 때 까지 반복
	{
		lst = lst->next; // 다음노드로 이동
		size++; // 노드 갯수 카운트
	}
	return (size); // 반환
}
