/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunze <hyunze@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/19 19:19:16 by hann              #+#    #+#             */
/*   Updated: 2020/08/11 18:04:41 by hyunze           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// 마지막 노드 반환하는 함수

t_list	*ft_lstlast(t_list *lst)
{
	if (lst == NULL)
		return (NULL); // lst가 존재해자 않을 경우 NULL 반환
	while (lst->next)
		lst = lst->next; // next멤버가 존재하지 않는 노드까지 이동
	return (lst); // lst반환
}
