/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_back.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By:        <                    >              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/21 20:30:06 by                   #+#    #+#             */
/*   Updated: 2020/08/11 18:17:37 by                  ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// 리스트 마지막에 새 노드 추가하는 함수

void	ft_lstadd_back(t_list **lst, t_list *new)
{
	if (lst == 0 || new == 0)
		return ; // lst나 new가 존재하지 않을 경우 리턴
	if (*lst == 0)
		*lst = new; // lst의 헤드가 비어있을 경우(빈 리스트)
	else
		(ft_lstlast(*lst))->next = new; // 마지막 노드의 next멤버에 new저장
}
