/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By:        <                    >              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/19 18:37:27 by                   #+#    #+#             */
/*   Updated: 2020/08/11 17:48:20 by                  ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// 리스트 제일 앞에 새 리스트 추가하는 함수

void	ft_lstadd_front(t_list **lst, t_list *new)
{
	if (lst == 0 || new == 0)
		return ; // lst나 new가 존재하지 않을 경우 리턴
	new->next = *lst; // new의 next멤버에 lst의 주소 저장
	*lst = new; // head의 주소에 new저장
}
